In [1]:
import pandas as pd
import numpy as np

## Hurricanes

In [2]:
canes = pd.read_csv('./hurricanes.csv')

In [42]:
ts = pd.read_csv('tropical_storms.csv')

In [3]:
canes.head()

,year,month,affected_states,state_1,state_2,state_3,state_4,state_5,state_6,state_7,category,mb_pressure,wind_kt,name
0,1851.0,Jun,"TX, C1",TX,NaN,NaN,NaN,NaN,NaN,NaN,1.0,974.0,80,-----
1,1851.0,Aug,"FL, NW3; I-GA, 1",FL,GA,NaN,NaN,NaN,NaN,NaN,3.0,955.0,100,"""Great Middle Florida"""
2,1852.0,Aug,"AL, 3; MS, 3; LA, 2; FL, SW2, NW1",AL,MS,LA,FL,NaN,NaN,NaN,3.0,961.0,100,"""Great Mobile"""
3,1852.0,Sep,"FL, SW1",FL,NaN,NaN,NaN,NaN,NaN,NaN,1.0,982.0,70,-----
4,1852.0,Oct,"FL, NW2; I-GA, 1",FL,GA,NaN,NaN,NaN,NaN,NaN,2.0,965.0,90,"""Middle Florida"""

In [43]:
ts.head()

,storm_number,date,time,lat_n,lon_w,max_winds(kt),landfall_state,storm_names
0,6,10/19/1851,1500,41.1,71.7,50,NY,NaN
1,3,8/19/1856,1100,34.8,76.4,50,NC,NaN
2,4,9/30/1857,1000,25.8,97.0,50,TX,NaN
3,3,9/14/1858,1500,27.6,82.7,60,FL,NaN
4,3,9/16/1858,300,35.2,75.2,50,NC,NaN

In [50]:
la = ts[ts['landfall_state'] == 'LA']

In [54]:
la.head()

,storm_number,date,time,lat_n,lon_w,max_winds(kt),landfall_state,storm_names
14,5,7/1865,0,29.7,92.0,60,LA,NaN
23,1,7/11/1872,500,29.1,89.1,50,LA,NaN
39,5,7/1879,500,29.0,89.2,50,LA,NaN
48,3,9/15/1882,500,29.8,93.7,50,LA,NaN
53,4,9/21/1885,300,29.0,89.4,50,LA,NaN

In [4]:
canes = canes.drop(columns=["affected_states", 'name'])

In [5]:
canes.head()

,year,month,state_1,state_2,state_3,state_4,state_5,state_6,state_7,category,mb_pressure,wind_kt
0,1851.0,Jun,TX,NaN,NaN,NaN,NaN,NaN,NaN,1.0,974.0,80
1,1851.0,Aug,FL,GA,NaN,NaN,NaN,NaN,NaN,3.0,955.0,100
2,1852.0,Aug,AL,MS,LA,FL,NaN,NaN,NaN,3.0,961.0,100
3,1852.0,Sep,FL,NaN,NaN,NaN,NaN,NaN,NaN,1.0,982.0,70
4,1852.0,Oct,FL,GA,NaN,NaN,NaN,NaN,NaN,2.0,965.0,90

In [6]:
canes['state_7'].value_counts()

MA    1
Name: state_7, dtype: int64

In [7]:
la1 = canes[canes["state_1"] == 'LA']

In [8]:
la2 = canes[canes["state_2"] == 'LA']

In [9]:
la3 = canes[canes["state_3"] == 'LA']

In [10]:
la4 = canes[canes["state_4"] == 'LA']

In [11]:
la1 = la1.drop(columns=['state_2', 'state_3', 'state_4', 'state_5', 'state_6', 'state_7'])

In [12]:
la2 = la2.drop(columns=['state_1', 'state_3', 'state_4', 'state_5', 'state_6', 'state_7'])

In [13]:
la3= la3.drop(columns=['state_1', 'state_2', 'state_4', 'state_5', 'state_6', 'state_7'])

In [14]:
la4= la4.drop(columns=['state_1', 'state_2', 'state_3', 'state_5', 'state_6', 'state_7'])

In [15]:
la1 = la1.rename(columns={"state_1": "state"})

In [16]:
la2 = la2.rename(columns={"state_2": "state"})

In [17]:
la3 = la3.rename(columns={"state_3": "state"})

In [18]:
la4 = la4.rename(columns={"state_4": "state"})

In [19]:
frames = [la1, la2, la3, la4]

louisiana = pd.concat(frames)

In [20]:
louisiana

       year month state  category  mb_pressure wind_kt
9    1855.0   Sep    LA       3.0        945.0     110
10   1856.0   Aug    LA       4.0        934.0     130
16   1860.0   Aug    LA       3.0        945.0     110
17   1860.0   Sep    LA       2.0        965.0      90
18   1860.0   Oct    LA       2.0        965.0      90
..      ...   ...   ...       ...          ...     ...
278  2005.0   Sep    LA       3.0        937.0     100
280  2007.0   Sep    LA       1.0        985.0      80
283  2008.0   Sep    LA       2.0        950.0      95
2    1852.0   Aug    LA       3.0        961.0     100
106  1906.0   Sep    LA       2.0        958.0      95

[63 rows x 6 columns]

In [21]:
louisiana["month"].value_counts()

Sep    27
Aug    17
Oct    12
Jul     4
Jun     3
Name: month, dtype: int64

In [22]:
louisiana.shape

(63, 6)

In [23]:
27/63

0.42857142857142855

percent of louisiana hurricanes in Septermber 42.88%

In [24]:
17/63

0.2698412698412698

percent of

In [25]:
12/63

0.19047619047619047

## Tropical Storms

In [26]:
tropics = pd.read_csv('./Continental United States Tropical Storms Impacts:Landfalls 1851-1970, 1983-2021.csv')

In [27]:
tropics.head()

,storm #,date,time,lat_n,lon_w,max_winds(kt),landfall_state,storm_names
0,6,10/19/1851,1500Z,41.1,71.7,50,NY,NaN
1,3,8/19/1856,1100Z,34.8,76.4,50,NC,NaN
2,4,9/30/1857$,1000Z,25.8,97.0,50,TX,NaN
3,3,9/14/1858$,1500Z,27.6,82.7,60,FL,NaN
4,3,9/16/1858*,0300Z,35.2,75.2,50,NC,NaN

In [28]:
tropics = tropics.drop(columns=["storm #", 'lat_n', 'lon_w', 'time'])

In [29]:
tropics.head()

         date  max_winds(kt) landfall_state storm_names
0  10/19/1851             50             NY         NaN
1   8/19/1856             50             NC         NaN
2  9/30/1857$             50             TX         NaN
3  9/14/1858$             60             FL         NaN
4  9/16/1858*             50             NC         NaN

In [30]:
la_tropics = tropics[tropics["landfall_state"] == 'LA']

In [31]:
la_tropics.shape

(49, 4)

In [32]:
tropical_s = pd.read_csv('tropical_storms.csv')

In [33]:
tropical_s.head()

,storm_number,date,time,lat_n,lon_w,max_winds(kt),landfall_state,storm_names
0,6,10/19/1851,1500,41.1,71.7,50,NY,NaN
1,3,8/19/1856,1100,34.8,76.4,50,NC,NaN
2,4,9/30/1857,1000,25.8,97.0,50,TX,NaN
3,3,9/14/1858,1500,27.6,82.7,60,FL,NaN
4,3,9/16/1858,300,35.2,75.2,50,NC,NaN

In [34]:
tropical_s.dtypes

storm_number        int64
date               object
time               object
lat_n             float64
lon_w             float64
max_winds(kt)       int64
landfall_state     object
storm_names        object
dtype: object

In [35]:
tropical_s.drop(columns=["storm_names", 'storm_number'])

           date  time  lat_n  lon_w  max_winds(kt) landfall_state
0    10/19/1851  1500   41.1   71.7             50             NY
1     8/19/1856  1100   34.8   76.4             50             NC
2     9/30/1857  1000   25.8   97.0             50             TX
3     9/14/1858  1500   27.6   82.7             60             FL
4     9/16/1858   300   35.2   75.2             50             NC
..          ...   ...    ...    ...            ...            ...
387      7/9/21  1630   41.4   71.7             50             RI
388     8/16/21  1900   29.7   85.4             55             FL
389     8/22/21  1520   41.2   71.6             55             RI
390     8/22/21  1615   41.3   71.8             55             RI
391      9/9/21   115   29.7   85.1             50             FL

[392 rows x 6 columns]

In [36]:
tropical_la = tropical_s[tropical_s["landfall_state"]=="LA"]

### Number of tropical storms to hit louisiana

In [37]:
tropical_la.value_counts()

storm_number  date      time  lat_n  lon_w  max_winds(kt)  landfall_state  storm_names
1             5/30/59   2200  29.6   91.6   55             LA              Arlene         1
5             9/5/58    1800  26.8   94.0   40             LA              Ella           1
14            10/10/04  1100  29.2   91.0   35             LA              Matthew        1
13            9/4/11    1030  29.6   92.1   40             LA              Lee            1
11            11/10/09  0     28.9   88.7   50             LA              Ida            1
10            9/26/02   600   29.1   90.3   55             LA              Isidore        1
9             9/14/02   800   29.1   89.1   50             LA              Hanna          1
              8/30/17   800   29.8   93.5   40             LA              Harvey         1
8             9/20/98   500   29.1   90.9   35             LA              Hermine        1
6             9/18/57   1200  29.2   90.9   55             LA              Esther         1
5             9/29/65   2000  29.1   90.2   35             LA              Debbie         1
1             6/13/56   1700  29.1   90.7   50             LA              Unnamed        1
5             8/27/55   400   30.0   89.2   45             LA              Unnamed        1
              7/29/54   1000  29.7   92.8   50             LA              Barbara        1
3             6/7/20    2200  29.3   89.8   45             LA              Cristobal      1
              6/30/03   1900  29.3   91.0   50             LA              Bill           1
              6/22/17   700   29.8   93.7   45             LA              Cindy          1
              6/19/21   430   29.2   91.0   40             LA              Claudette      1
2             8/5/02    200   29.4   89.3   35             LA              Bertha         1
1             8/1/55    1700  29.7   89.4   55             LA              Brenda         1
23            10/1/69   600   27.9   86.6   35             LA              Unnamed        1
dtype: int64

In [38]:
tropical_la.value_counts().sum()

21

In [56]:
la.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49 entries, 14 to 383
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   storm_number    49 non-null     int64
 1   date            49 non-null     object
 2   time            49 non-null     object
 3   lat_n           49 non-null     float64
 4   lon_w           49 non-null     float64
 5   max_winds(kt)   49 non-null     int64
 6   landfall_state  49 non-null     object
 7   storm_names     21 non-null     object
dtypes: float64(2), int64(2), object(4)
memory usage: 3.4+ KB

In [66]:
la.head()

,storm_number,date,time,lat_n,lon_w,max_winds(kt),landfall_state,storm_names
14,5,7/1865,0,29.7,92.0,60,LA,NaN
23,1,7/11/1872,500,29.1,89.1,50,LA,NaN
39,5,7/1879,500,29.0,89.2,50,LA,NaN
48,3,9/15/1882,500,29.8,93.7,50,LA,NaN
53,4,9/21/1885,300,29.0,89.4,50,LA,NaN

In [75]:
months = la['date']

In [96]:
month = []

for mon in months:
    month.append(mon[0])

In [97]:
month

['/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '0',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '0',
 '0',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '/',
 '0',
 '/',
 '/',
 '/',
 '/',
 '/',
 '0',
 '1',
 '/',
 '/',
 '/',
 '/',
 '/']

In [84]:
la['month'] = month

/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_41002/3411313911.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la['month'] = month

In [86]:
la['month'] = pd.to_numeric(la['month'])

/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_41002/4239912277.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la['month'] = pd.to_numeric(la['month'])

In [88]:
la['month'].value_counts()

9    21
7     7
8     7
6     7
1     6
5     1
Name: month, dtype: int64

In [89]:
louisiana["month"].value_counts()

Sep    27
Aug    17
Oct    12
Jul     4
Jun     3
Name: month, dtype: int64

In [98]:
print(f'september: {21+27}')
print(f'August: {17+7}')
print(f'October: {12+5}')
print(f'July: {4+7}')
print(f'June: {3+7}')

september: 48
August: 24
October: 17
July: 11
June: 10

## Hurricanes and Tropical Storms
- September: 48
- August: 24
- October: 17
- July: 11
- June: 10